{
  "batman-effect": {
    "0": {
      "template": "Choose your character: This can be a fictional character, someone who inspires you or even an animal.  You can also write [your name]. Be as creative as you would like. "
    },
    "1": {
      "template": "Make a list of your character's attributes: And remember, if it's too different from you now, it's going to feel unachievable.  Be specific. Focus on the beliefs they hold, the energy they bring and the attitude they have. "
    },
    "2": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "3": {
      "template": "Build: Start by seeing the character version of you in your mind. What do they look like?  What is their body language? Look into their eyes and feel their energy."
    },
    "4": {
      "template": "Rehearse: Start mentally rehearsing how your character approaches a task/day/life. Watch them like a movie.  How does this version of you speak? Walk? Interact? Exercise?"
    },
    "5": {
      "template": "Add emotion: Feel the emotion of them. What does it feel like to be them? Fully embody this."
    },
    "6": {
      "template": "Get present and commit: Bring the energy, behaviours and mindset of your character to the present moment.  Commit to the character. Be excited as you take the steps to become them. "
    },
    "7": {
      "template": "Close with power: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "unstoppable-confidence": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Build: Start by seeing the confident version of you in your mind. Build them up from head to toe.  What are they wearing? What does their body language show? Chest out, strong eye contact, head high. "
    },
    "2": {
      "template": "Create context: Take this vision of you and place them in the situations and environments you will be in. For example, at work, at home, socialising, networking, pitching, playing sport, winning and so on. "
    },
    "3": {
      "template": "Mentally rehearse details: Start mentally rehearsing how you would think, feel and perform as this confident version of you.  What does it look like? How do you approach the activities? What do you say to yourself and others? How do you walk into a room, or onto the stage, pitch or court? "
    },
    "4": {
      "template": "Embrace emotion: What does it actually feel like to be confident? Energised and fiery? Peaceful and calm? Driven?"
    },
    "5": {
      "template": "Make it specific: Spend two minutes mentally rehearsing different situations or a particular situation you are focusing on. Add texture and more details."
    },
    "6": {
      "template": "Get present: Take a moment to bring this confidence to the present moment.  Feel it in your body, here and now. It might be like a warm buzz or a shock of electricity. Deepen your breath and make this feeling even bigger. "
    },
    "7": {
      "template": "Commit: Commit to this version of yourself, even if it’s just 1 per cent, and bring them into your day/week ahead. "
    },
    "8": {
      "template": "Close with confidence: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "productivity-focus": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Mentally rehearse the task: Picture the task you need to complete. Add all the details. Where are you sitting?  Are you on your laptop? What are you wearing?"
    },
    "2": {
      "template": "Visualise completion: See yourself executing and finishing the task successfully. This is the key part – to repeatedly visualise yourself completing the task until it feels easy and effortless in your mind."
    },
    "3": {
      "template": "Spend extra time on challenging tasks: If you find a particular task difficult or have resistance to it, spend more time visualising that one. Picture yourself staying focused, even if distractions arise, and bring your attention back to the task. "
    },
    "4": {
      "template": "Close with focus: Take five more deep breaths, a moment of stillness, gently open your eyes and start the task. "
    }
  },
  "integrated-skill": {
    "0": {
      "template": "This visualization is designed to help you learn and improve a specific skill, handle pressure, or a combination of both. The goal is to make the mental rehearsal as realistic as possible to strengthen the mind-body connection."
    },
    "1": {
      "template": "Prepare and Set Intention: Find a comfortable position and close your eyes. Take five deep breaths, releasing tension. The purpose of this session is to build a skill so that the mind and body are prepared for what it will actually feel like to perform."
    },
    "2": {
      "template": "Build a Multi-Sensory World: Begin by creating the environment in your mind where you will perform your skill. Make it as real as possible by engaging all your senses. What do you see? What do you hear? What do you feel?. Combine these mental images with real physical sensations, for example by moving your body in a realistic way."
    },
    "3": {
      "template": "Start Easy (Low-Pressure Scenario): First, visualize yourself in a low-pressure training situation. See yourself performing the skill you are working on. Rehearse it perfectly, focusing on accurate and positive execution."
    },
    "4": {
      "template": "Execute in Real-Time (First-Person): See the performance through your own eyes and feel what you feel. Mentally rehearse the skill at the same speed it would happen in reality (\"real time\"). Feel what it feels like to perform it correctly."
    },
    "5": {
      "template": "Analyze and Refine (Third-Person): Now, shift your perspective. Watch yourself from the outside, as if on video, to learn how your new skill looks. Observe your movements and technique."
    },
    "6": {
      "template": "Fix Mistakes: If at any point in your visualization you make a mistake, pause and \"rewind\" the mental image. Correct the error and rehearse the segment again perfectly. This builds the habit of correct execution."
    },
    "7": {
      "template": "Increase Difficulty (High-Pressure Scenario): Now, shift the environment to a more demanding, high-pressure situation. Include realistic challenges and accept the feelings that arise as part of the experience. Set a specific goal for this high-pressure scenario, such as maintaining focus, staying relaxed, or executing a difficult part of your skill."
    },
    "8": {
      "template": "Final Perfect Repetition: Once more, see yourself executing the entire skill perfectly in the high-pressure environment. Feel the sense of control, focus, and success that comes with it."
    },
    "9": {
      "template": "Close with Control: Bring your attention back to your breath. Take five more deep breaths. Acknowledge the quality of the session and your ability to control your focus. Gently open your eyes."
    }
  },
  "top-1-percent": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Create the environment: Place yourself in the environment you will be in when you are performing the chosen task.  Are you inside? Outside? What can you see? Who else is there?"
    },
    "2": {
      "template": "Perform: Mentally rehearse yourself performing the task in the exact way you want to.  What does an optimal performance look like? Focus on your movement, pace, accuracy and consistency. "
    },
    "3": {
      "template": "Go deeper: What part of your body is most intensely involved in performing the activity?  What are your hands doing? Go as detailed as feeling it in your muscles. Tune into the sensations in your body."
    },
    "4": {
      "template": "Add details: What other details are there? Is there anyone watching? Who do you see?  Are there other objects involved? Hear the sounds and the noises."
    },
    "5": {
      "template": "Add emotion: How do you feel performing the activity? In flow? Focused? Energised?"
    },
    "6": {
      "template": "1 per cent better: What does performing 1 per cent better look like? What changes? How do you carry out the action now?"
    },
    "7": {
      "template": "Repeat: Keep repeating the performance until your mind gets into a flow state with it. See it from the first and third person, repeating the performance the exact way you want it to go. "
    }
  },
  "peak-performance-sports": {
    "0": {
      "template": "Take a moment to think about an area in fitness or sport that you want to refine or improve. This could be taking a tennis penalty, lifting heavier weights, or a long-term goal such as running a marathon."
    },
    "1": {
      "template": "Find a comfortable space and close your eyes. Move your body to release tension, take four deep breaths, and a moment of stillness."
    },
    "2": {
      "template": "Start by mentally immersing yourself in the environment where you'll perform. Imagine every detail - whether it's the track, gym, field, court, or road. Notice the smells, sounds, temperature, and textures around you."
    },
    "3": {
      "template": "Start to see yourself performing the activity well. Visualize the movements in step-by-step detail. What are your legs doing? How do your arms move? Where is your focus? Picture your body in motion, feeling strong and coordinated. Be as precise as possible, imagine every movement, every adjustment, and every position."
    },
    "4": {
      "template": "Now, amplify the energy of the performance. Feel the sweat. Get into a rhythm and flow. What does performing 1 percent or 10 percent better look like? Practice the action again and again until it feels effortless."
    },
    "5": {
      "template": "How does it feel in your body? How do you want to feel as you are doing it? Feel the adrenaline. The drive. The strength. See yourself overcoming the harder moments if needed."
    },
    "6": {
      "template": "Once the action and activity feel aligned, take four more deep breaths, a moment of stillness, and gently open your eyes."
    }
  },
  "breath-awareness": {
    "0": {
      "template": "Make any final movements you need before preparing to sit still for the entire exercise."
    },
    "1": {
      "template": "Start by observing your breath."
    },
    "2": {
      "template": "Just as it is."
    },
    "3": {
      "template": "When you observe what is happening, as it happens, regardless of what it is, you are awake."
    },
    "4": {
      "template": "Where is your attention now?"
    },
    "5": {
      "template": "Where is your attention now?"
    },
    "6": {
      "template": "Now, you can consciously expand your awareness to include the entire body and whatever might arise in your consciousness."
    },
    "7": {
      "template": "Observe everything as it is."
    },
    "8": {
      "template": "The exercise is over."
    }
  },
  "goal-visualization": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Focus: Start by bringing your attention to the goal/project/mission you are working on. The thing that excites you."
    },
    "2": {
      "template": "Visualise the end result: Start seeing yourself successfully achieving the goal. Visualise the results in advance.  What does it look like? Where are you? Are you inside? Outside? Is it cold? Hot?  See the shapes and colours all around. Place yourself where you will be."
    },
    "3": {
      "template": "Add details: What can you hear? What types of conversations are happening? Is there cheering? Is there music? Who else is there?"
    },
    "4": {
      "template": "Go deeper: What are you wearing? What are you drinking or eating? Taste the food.  What activities are you doing? Remember, this is your goal and you have already achieved it.  What does the result look like? Try to see if you get a better picture of what it looks like. "
    },
    "5": {
      "template": "Connect emotionally: How do you want to feel? Proud? Excited? Peaceful? Fulfilled? Driven?  Start bringing this emotion into your body. Combine it with your vision and goal."
    },
    "6": {
      "template": "Go bigger: Let’s take it up a notch. Imagine going 1 per cent bigger – what would this goal look like then? What would you do or try if you didn’t let fear and doubt take over?  Let your mind stretch and explore this bigger, bolder vision. Sit here for a few minutes. "
    },
    "7": {
      "template": "Rehearse an action: Now, mentally rehearse yourself taking one action towards this goal.  No matter how small or big, what is the first step? See yourself taking action. Commit to it. "
    },
    "8": {
      "template": "Close with clarity: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "sports-fitness": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Place yourself in the environment: Start by mentally immersing yourself in the exact environment where you’ll perform. Imagine every detail."
    },
    "2": {
      "template": "Add more detail: Go on to see yourself performing the activity well. Visualise the movements in step-by-step detail.  Where is your focus? Picture your body in motion, feeling strong and coordinated. Be as precise as possible; imagine every movement, every adjustment and every position. "
    },
    "3": {
      "template": "Build momentum: Now, amplify the energy of the performance. Feel the sweat. Get into a rhythm and flow. What does performing 1 per cent or 10 per cent better look like? Rehearse the action again and again until it feels effortless. "
    },
    "4": {
      "template": "Add emotion: How does it feel in your body?  How do you want to feel as you are doing it? Feel the strength. The drive. The strength. See yourself overcoming the harder moments too if needed."
    },
    "5": {
      "template": "Close with grit: Once the action and activity feel aligned, take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "letting-go": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Locate: Imagine you are sitting by a flowing river. Listen to the sound of the water, feel the sun shining on your hair and just focus on the water’s movement. "
    },
    "2": {
      "template": "Mentally write: Now, in your visualisation, write down the person, situation, event or feeling that you want to let go of on a piece of paper. "
    },
    "3": {
      "template": "Place the paper into the river: Watch it start to drift away. It goes further and further.  Keep watching until you can barely see it. It’s so far out, the piece of paper has now gone. "
    },
    "4": {
      "template": "Let go: Focus back on the flowing water and take five more deep breaths. With each exhale, let go of any emotion or memory that has come up. "
    },
    "5": {
      "template": "Repeat: Circulate this with as many different things as you need to or as many times as you need to."
    },
    "6": {
      "template": "Close with relief: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "rehearsing-day": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Visualise the day: Start mentally rehearsing the string of tasks you need to do from morning to evening, no matter how small, big, boring or exciting (meetings, emails, breaks, cooking, going to the gym, events and so on). "
    },
    "2": {
      "template": "Perform well: See yourself executing them the way you want to – performing well, maintaining focus and executing with intention. "
    },
    "3": {
      "template": "Add emotion: How do you want to feel today? Who do you want to show up as?  What is your attitude going to be? Start adding this to your visualisation. Show yourself who you want to be. I would suggest choosing things like energised, calm, productive, confident and so on. "
    },
    "4": {
      "template": "Repeat: Rehearse the day as many times as you need to until you feel ready to go."
    },
    "5": {
      "template": "Take action: Finish by seeing the first action you need to take after opening your eyes."
    },
    "6": {
      "template": "Close with energy: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "releasing-anxiety": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Locate the anxiety in your body: Take a moment to think about what is making you anxious.  Bring it to the present. Notice where in your body you are feeling the anxiety. What does it feel like?  Is the sensation heavy? Tight?"
    },
    "2": {
      "template": "Visualise the anxiety: Now, visualise what this anxiety looks like in your body.  Give it a colour, a shape or even make it a character or animal. Is it hot? Is it cold?  This is your imagination’s way of processing the emotion. And now just sit with it.  Don’t try to run away or ignore it. Let the feeling do its thing. "
    },
    "3": {
      "template": "Let it get bigger: This might get a bit uncomfortable, but stay with it.  Allow the shape/character to get bigger and bigger. Feel it. "
    },
    "4": {
      "template": "Shrink the image: And now, using your mind, let this image get smaller and smaller. You can be as creative as you like with how you want to make this happen.  Do you pour water on it? Do you kill it? Do you just let it dissolve? "
    },
    "5": {
      "template": "Repeat: Keep repeating this until the image gets so small it’s the size of a pea."
    },
    "6": {
      "template": "Release: Take a deep breath and, on the exhale, let the image fully dissolve and be released. "
    },
    "7": {
      "template": "Locate again: Take your awareness back to the area in your body and notice the change you feel."
    },
    "8": {
      "template": "Repeat: Continue this as many times as you need to until the intensity of the anxiety becomes less consuming, and you feel relief. "
    },
    "9": {
      "template": "Close with lightness: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "hope-resilience": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths and a moment of stillness. "
    },
    "1": {
      "template": "Context: Bring your attention to the current challenge you are facing. Break-up? Redundancy? Feeling stuck? Feel any emotions that come with it."
    },
    "2": {
      "template": "Cultivate hope: Start by seeing yourself getting through it and on the other side of the hardship.  What does it look like? What are you doing? Who else is there?  Rehearse all the different ways you can come out strong on the other side. Create hope in your vision."
    },
    "3": {
      "template": "Celebrate: Take it even further and see yourself celebrating after. What would you do? Spend a few minutes here. Feel the relief and gratitude."
    },
    "4": {
      "template": "Close with hope: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  },
  "sample-filled": {
    "0": {
      "template": "Find a comfortable position...",
      "pole_vault": "Find a comfortable position...",
      "horizontal_jumps": "Find a comfortable position...",
      "high_jump": "Find a comfortable position...",
      "distance_running": "Find a comfortable position...",
      "sprinting": "Find a comfortable position...",
      "throws": "Find a comfortable position..."
    },
    "1": {
      "template": "Focus:",
      "pole_vault": "Start by bringing your attention to the specific height you are vaulting.",
      "horizontal_jumps": "Start by bringing your attention to the specific distance you will jump.",
      "high_jump": "Start by bringing your attention to the specific height you will clear.",
      "distance_running": "Start by bringing your attention to the race you are running and the time you are chasing.",
      "sprinting": "Start by bringing your attention to the finish line and a flawless execution.",
      "throws": "Start by bringing your attention to the specific distance mark you will hit."
    },
    "2": {
      "template": "Visualise the end result:",
      "pole_vault": "Start seeing yourself successfully clearing the height. You arch over the bar, land on the mat, and see the bar stay on.",
      "horizontal_jumps": "Start seeing yourself successfully hitting the board perfectly and flying through the air, landing deep in the sand.",
      "high_jump": "Start seeing yourself successfully clearing the height. You take off powerfully, arching your back over the bar and landing cleanly.",
      "distance_running": "Start seeing yourself successfully finishing the race. You cross the finish line, feeling strong, and see the clock with your target time.",
      "sprinting": "Start seeing yourself successfully exploding from the blocks. You accelerate perfectly and lean at the tape, crossing the finish line first.",
      "throws": "Start seeing yourself successfully unleashing a powerful throw. You see the implement flying in a perfect arc and landing far out in the sector."
    },
    "3": {
      "template": "Add details:",
      "pole_vault": "What can you hear? The crowd clapping rhythmically? The announcer calling your name?",
      "horizontal_jumps": "What can you hear? The official calling out your huge distance? The applause from the crowd?",
      "high_jump": "What can you hear? The collective gasp of the crowd, followed by a roar as you clear the bar?",
      "distance_running": "What can you hear? The sound of the bell for the final lap? The roar of the crowd on the home stretch?",
      "sprinting": "What can you hear? The sound of the starter's gun? The roar of the stadium for the 10 seconds of the race?",
      "throws": "What can you hear? The sound of your own powerful grunt on release? The official marking your throw?"
    },
    "4": {
      "template": "Go deeper:",
      "pole_vault": "What are you wearing? Feel the chalk on your hands and the grip on the pole. You are celebrating on the landing pit.",
      "horizontal_jumps": "What are you wearing? Feel the explosive power in your legs on takeoff. You are celebrating next to the sandpit.",
      "high_jump": "What are you wearing? Feel the weightless sensation at the peak of your jump. You are celebrating on the landing mat.",
      "distance_running": "What are you wearing? Feel the rhythm of your stride and breath. You are catching your breath past the finish line, arms raised.",
      "sprinting": "What are you wearing? Feel the power in your arm drive and leg turnover. You are slowing down past the finish line, looking at the scoreboard.",
      "throws": "What are you wearing? Feel the implement in your hand just before you begin. You are watching your throw land, knowing it's a big one."
    },
    "5": {
      "template": "Connect emotionally:",
      "pole_vault": "How do you want to feel? Proud? Excited? Relieved?",
      "horizontal_jumps": "How do you want to feel? Proud? Powerful? Explosive?",
      "high_jump": "How do you want to feel? Proud? Light? Successful?",
      "distance_running": "How do you want to feel? Proud? Strong? Resilient?",
      "sprinting": "How do you want to feel? Proud? Fast? Dominant?",
      "throws": "How do you want to feel? Proud? Powerful? Unleashed?"
    },
    "6": {
      "template": "Go bigger:",
      "pole_vault": "Let's take it up a notch. Imagine clearing a national record. What would that look like?",
      "horizontal_jumps": "Let's take it up a notch. Imagine breaking the championship record. What would that look like?",
      "high_jump": "Let's take it up a notch. Imagine winning the Olympic final. What would that look like?",
      "distance_running": "Let's take it up a notch. Imagine winning a major championship race. What would that look like?",
      "sprinting": "Let's take it up a notch. Imagine running a legendary time in a final. What would that look like?",
      "throws": "Let's take it up a notch. Imagine throwing a distance that wins a gold medal. What would that look like?"
    },
    "7": {
      "template": "Rehearse an action:",
      "pole_vault": "Now, mentally rehearse... your powerful run-up and the perfect plant of the pole.",
      "horizontal_jumps": "Now, mentally rehearse... your final two steps and the explosive takeoff from the board.",
      "high_jump": "Now, mentally rehearse... your curved approach and powerful upward drive at takeoff.",
      "distance_running": "Now, mentally rehearse... your final kick on the last lap, pulling away from the competition.",
      "sprinting": "Now, mentally rehearse... your explosive start from the blocks in reaction to the gun.",
      "throws": "Now, mentally rehearse... your perfect technique in the circle or on the runway, and the final, explosive release."
    },
    "8": {
      "template": "Close with clarity:",
      "pole_vault": "Take five more deep breaths...",
      "horizontal_jumps": "Take five more deep breaths...",
      "high_jump": "Take five more deep breaths...",
      "distance_running": "Take five more deep breaths...",
      "sprinting": "Take five more deep breaths...",
      "throws": "Take five more deep breaths..."
    }
  },
  "building-self-belief": {
    "0": {
      "template": "Prepare: Find a comfortable position and close your eyes. Move your body to release tension, take five deep breaths for a moment of stillness. "
    },
    "1": {
      "template": "Position: Place yourself in an environment or situation where you normally feel a lack of self-belief.  It could be something coming up that feels unfamiliar. It could be a past memory where your mind stopped you from doing something or you felt like an imposter.  Immerse yourself in your surroundings. What can you hear? What are you wearing? What can you see?"
    },
    "2": {
      "template": "Frame: Ask yourself, if I had more self-belief and trust in myself, how would I act in this situation?  What would I do? How would I speak? How would I sound? How would I show up for myself? Watch yourself carrying out these actions in a new way. "
    },
    "3": {
      "template": "Add emotion: How does it feel to have more self-belief? Is it warm? Is it tingly in your chest?  Is it strong and exciting? Connect with your body so it becomes even stronger for the mind. Keep rehearsing the situation until it feels better in your mind and body."
    },
    "4": {
      "template": "Commit: Choose to commit to this self-belief. Repeat out three sentences of self-talk at the end if you want."
    },
    "5": {
      "template": "Close with certainty in yourself: Take five more deep breaths, a moment of stillness and gently open your eyes. "
    }
  }
}